def truth_table_check(x1,x2,x3):
    table = {
        (0, 0, 0): 1,
        (0, 0, 1): 0,
        (0, 1, 0): 1,
        (0, 1, 1): 0,
        (1, 0, 0): 0,
        (1, 0, 1): 1,
        (1, 1, 0): 0,
        (1, 1, 1): 1
    }
    return table.get((x1,x2,x3), "Невідома комбінація")


print("Перевірка таблиці істинності (варіант 27)")
x1 = int(input("Введіть x1 (0 або 1): "))
x2 = int(input("Введіть x2 (0 або 1): "))
x3 = int(input("Введіть x3 (0 або 1): "))
result = truth_table_check(x1, x2, x3)
print(f"Результат f({x1},{x2},{x3}) = {result}")